app/controllers/abouts_controller.rb

  def index
    @title = 'About our Haunted Barns'
    @abouts = About.all
    # Log an event
    Event.create :name => 'PageView', :description => request.url, :useragent => request.headers['user-agent'],
                 :referer => request.headers['referer'], :ip => request.remote_ip
---
SELECT * FROM `abouts`
INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:11:41', NULL, 'http://www.kitsaphauntedfairgrounds.com/images/HauntedMenu.swf', 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/abouts')