app/controllers/application_controller.rb

  def track
    # Log an event
    params.reject{|k,v| ['action', 'controller'].include? k}.each do |event_type, event_detail|
      Event.create :name => event_type, :description => event_detail,
                   :ip => request.remote_ip, :useragent => request.headers['user-agent']
---
INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('tabClick', '2011-06-29 04:10:57', NULL, NULL, 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'Hours')

  def set_current_user
    @user = Thread.current['user'] = User.find_by_id(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1