app/controllers/headlines_controller.rb

INSERT INTO `headlines` (`created_at`, `title`, `post`, `updated_at`, `created_by`, `updated_by`, `status`) VALUES('2011-06-29 04:38:23', '2011 headline', 'just to put something here', '2011-06-29 04:38:23', 1, 1, 'active')
---
  def create
    headline = Headline.new(params[:headline])
    headline.status = 'active'

    respond_to do |format|
      if headline.save