app/controllers/home_controller.rb

SELECT * FROM `headlines` WHERE (`headlines`.`status` = 'active') ORDER BY created_at DESC
SELECT * FROM `open_dates` WHERE (`open_dates`.`status` = 'active') ORDER BY date_open asc
SELECT * FROM `tickets` WHERE (`tickets`.`status` = 'active') ORDER BY price asc
INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:10:51', NULL, NULL, 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/')
---
  def index
    @year = (params[:year].nil? ? Date.today.year : params[:year].to_i )
    @title = 'Haunted House Home ' + @year.to_s

    headlines_per_page = 4
    @all_headlines = Headline.find(:all, :order => "created_at DESC", :conditions => {:status => 'active'})
    current_headlines = @all_headlines.select{|h| h.created_at.year == @year}
    @current_headlines_grouped = []
    current_headlines.each_slice(headlines_per_page){|slice| @current_headlines_grouped << slice}

    @open_dates = OpenDate.find(:all, :order => "date_open asc", :conditions => "status = 'active' AND EXTRACT(YEAR FROM date_open) = #{@year}")
    @tickets = Ticket.find(:all, :order => "price asc", :conditions => {:status => 'active'})

    # Log an event
    Event.create :name => 'PageView', :description => request.url, :useragent => request.headers['user-agent'],
                 :referer => request.headers['referer'], :ip => request.remote_ip

INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:11:43', NULL, 'http://www.kitsaphauntedfairgrounds.com/images/HauntedMenu.swf', 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/videos')
---
  def videos
    @title = 'Videos from Spook Central'
    youtube_client = GData::Client::YouTube.new
    all_videos = []

    #TODO cache this response
    feed = youtube_client.get('http://gdata.youtube.com/feeds/api/users/KitsapHaunt/uploads?v=2&format=5&orderby=published').to_xml
    feed.elements.each('entry') do |entry|
      vid = Video.new
      vid.title = entry.get_elements('title')[0].text
      vid.url = entry.get_elements('media:group')[0].get_elements('media:content').select{|mc| mc.attribute('yt:format').value == '5'}[0].attribute('url').value + "&rel=0&color1=0x5b2b2b&color2=0xb66b6b&border=1&fs=1"
      all_videos << vid
    end
    @videos = all_videos.paginate(:page => params[:page], :per_page => 4)

    # Log an event
    Event.create :name => 'PageView', :description => request.url, :useragent => request.headers['user-agent'],
                 :referer => request.headers['referer'], :ip => request.remote_ip

INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:11:44', NULL, 'http://www.kitsaphauntedfairgrounds.com/images/HauntedMenu.swf', 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/directions')
---
  def directions
    @title = 'Directions to this House of Haunts and Terror'
    @khf_address = ''
    @main_css_class = 'directions'
    render 'directions', :layout => 'khf_no_tabs'

    # Log an event
    Event.create :name => 'PageView', :description => request.url, :useragent => request.headers['user-agent'],
                 :referer => request.headers['referer'], :ip => request.remote_ip

UPDATE `users` SET `updated_at` = '2011-06-29 04:30:47', `last_login` = '2011-06-29 04:30:47' WHERE `id` = 1
INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:11:34', NULL, 'http://www.kitsaphauntedfairgrounds.com/', 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/login')
---
  def login
    @no_loginout = true # don't display loginout div
    @title = 'Login'
    if request.post?
      @user = User.authenticate( params[:user][:email], params[:user][:password] )
      if !@user.nil?
        session[:user_id] = @user.id
        flash[:message] = "Successfully logged in as #{@user.name}"
        @user.last_login = Time.now.utc
        @user.save(false)
        update_session_expiration
        # Log an event
        Event.create :name => 'Login', :description => 'Success', :useragent => request.headers['user-agent'],
                     :referer => request.headers['referer'], :ip => request.remote_ip

INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('Logout', '2011-06-30 02:22:17', 1, 'http://www.kitsaphauntedfairgrounds.com/', 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'Success')
---
  def logout
    session[:user_id] = nil
    flash[:message] = "Successfully logged out."
    # Log an event
    Event.create :name => 'Logout', :description => 'Success', :useragent => request.headers['user-agent'],
                 :referer => request.headers['referer'], :ip => request.remote_ip