app/controllers/links_controller.rb

SELECT * FROM `links` WHERE (`links`.`status` = 'active')
INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:11:47', NULL, 'http://www.kitsaphauntedfairgrounds.com/images/HauntedMenu.swf', NULL, '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/links')
---
  def index
    @title = 'Links to other Haunted Houses, Insane Asylums, and Gory Scary Places'
    @links = Link.find(:all, :conditions => {:status => 'active'})
    # Log an event
    Event.create :name => 'PageView', :description => request.url,
                 :referer => request.headers['referer'], :ip => request.remote_ip