app/controllers/photos_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 28)
INSERT INTO `events` (`name`, `created_at`, `created_by`, `referer`, `useragent`, `ip`, `description`) VALUES('PageView', '2011-06-29 04:37:25', 1, 'http://www.kitsaphauntedfairgrounds.com/videos', 'Mozilla/5.0 (X11; Linux i686 (x86_64)) AppleWebKit/534.30 (KHTML, like Gecko) Chrome/12.0.742.100 Safari/534.30', '127.0.0.1', 'http://www.kitsaphauntedfairgrounds.com/photos')
---
  def index
    @title = 'Photos from the Haunted Freak Show'
    conds = {'photos.status' => 'active'}
    if @user and @user.role != 'normal'
    else
      if params[:category].nil?
        params[:category] = '2007'
      end
    end
    conds['categories.name'] = params[:category] unless params[:category].nil?
    @photos = Photo.find(:all, :joins => :category, :conditions => conds)

    # Log an event
    Event.create :name => 'PageView', :description => request.url, :useragent => request.headers['user-agent'],
                 :referer => request.headers['referer'], :ip => request.remote_ip

SELECT * FROM `categories` WHERE (`categories`.`name` = 'Baz') LIMIT 1
SELECT `photos`.* FROM `photos` INNER JOIN `categories` ON `categories`.id = `photos`.category_id WHERE (`photos`.`status` = 'active' AND `categories`.`name` = 'Baz')
---
  def gallery
    @photos = Photo.find(:all, :joins => :category, :conditions => {'photos.status' => 'active', 'categories.name' => params[:category]})